# CannotHaveIndependentOverlappingGrids Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CurtainWallFailures..::..CannotHaveIndependentOverlappingGrids Property
BuiltInFailures..::..CurtainWallFailures Class See Also
---
Overlapping independent type associated gridlines are not allowed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotHaveIndependentOverlappingGrids { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotHaveIndependentOverlappingGrids As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotHaveIndependentOverlappingGrids {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CurtainWallFailures Class
Autodesk.Revit.DB Namespace